Repository: lang-uk/translation-metrics
Catalog: data/17099743/Animal_farm_combine.tmx
Source language: en_1945_george_orwell_animal_farm
Languages: uk_1984_iryna_dybko_khutir_tvaryn, uk_1991_yurii_shevchuk_ferma_rai_dlia_tv, uk_2020_bohdana_nosenok_kolhosp_tvaryn

source: For a long time the quarry was full of snowdrifts and nothing could be done.
uk_1984_iryna_dybko_khutir_tvaryn: Але, з уваги на великі снігові опади та заметіль, достава їх була внеможливлена.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Каменоломню на тривалий час вкрили снігові кучугури, тож годі було за щось братися.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Кар’єр замело снігом, і до валунів годі було дістатися.

source: Some progress was made in the dry frosty weather that followed, but it was cruel work, and the animals could not feel so hopeful about it as they had felt before. They were always cold, and usually hungry as well.
uk_1984_iryna_dybko_khutir_tvaryn: Аж по деякому часі, коли пройшли сніговії, а наступали морози, тварини почали жорстоку працю. З кожним днем їхні сили слабшали бадьорість зникала, бо крім невблаганного холоду чи не найдошкульнішим був постійний голод, а причина його - зменшені приділи харчів.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Діло трохи зрушило, коли встановилася суха морозна погода, але все одно то була каторжна праця, і тварини не могли покладати на неї тих сподівань, що колись. Вони завжди мерзли і завжди голодували.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Потроху робота просувалася лише в суху морозну погоду, але умови праці були надзвичайно важкими, і настрій будівничих був далекий від оптимістичного. Вони постійно мерзли, до того ж зазвичай були голодні.

source: Squealer made excellent speeches on the joy of service and the dignity of labour, but the other animals found more inspiration in Boxer’s strength and his never-failing cry of “I will work harder!”.
uk_1984_iryna_dybko_khutir_tvaryn: Під час безпорадної розпуки, коли вже тваринам не хотілось, нізвідки з’являвся Нікітов і, походжаючи навкруг утомлених тварин, банально схвалював гідність невтомної праці для виконання запланованих трудоднів. Але не з промов Нікітова й підбадьорювання похвалами тварини набирали наснаги-поштовху до праці, а з невтомно- завзятих зусиль Добрилова, бо він за найнеймовірніших обставин повторяв своє мотто «я працюватиму дужче».
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Пищик виголошував блискучі промови про самовіддане служіння справі і героїзм праці, але тварин більше надихала Боксерова сила і його незмінний клич «Я працюватиму ще завзятіше!»
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Пискун виголошував чудові промови про радість корисної праці, про гідність трудівника, але тварини черпали натхнення не з них, а з невичерпної сили Боксера та його незмінного гасла: «Працюватиму більше!»

source: In January food fell short.
uk_1984_iryna_dybko_khutir_tvaryn: В місяці січні брак харчування почав дошкульно відчуватись.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: У січні забракло харчу.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: У січні майже не стало корму.

source: The corn ration was drastically reduced, and it was announced that an extra potato ration would be issued to make up for it.
uk_1984_iryna_dybko_khutir_tvaryn: Приділи зерна з кожним днем зменшувалися; свині обіцяли, що замість зерна збільшуватимуть приділ картоплі,
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Різко зменшилася зернова пайка, а тоді оголосили, що натомість вводиться додаткова пайка картоплі.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Різко зменшилася порція зерна, потім оголосили, що його замінять картоплею.

source: Then it was discovered that the greater part of the potato crop had been frosted in the clamps, which had not been covered thickly enough. The potatoes had become soft and discoloured, and only a few were edible.
uk_1984_iryna_dybko_khutir_tvaryn: але по декількох днях повідомили, що картопля під час сильних морозів, без належного прикриття, вся померзла.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Згодом виявилось, що більша частина картоплі померзла в кагатах, бо їх погано вкрили. Картопля розм'якла і знебарвилась; лише мала частка її годилася для їжі.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Та одразу виявилося, що картопля майже цілком перемерзла, бо її погано вкрили.

source: For days at a time the animals had nothing to eat but chaff and mangels.
uk_1984_iryna_dybko_khutir_tvaryn: Бували дні, що й без найменшого приділу харчування мусіли звірята йти до пращ, тільки під вечір, як повертались від будови вітряка, давали їм полови й соломи.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Бували дні, коли тварини трималися на висівках і кормовому буряку.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Кілька днів поспіль тварини харчувалися лише соломою і буряком.

source: Starvation seemed to stare them in the face.
uk_1984_iryna_dybko_khutir_tvaryn: Безмежний голод щораз настирливіше заглядав у вічі...
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Здавалося, у вічі заглядає голодна смерть.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Здавалося, перед ними замаячила голодна смерть.

source: It was vitally necessary to conceal this fact from the outside world.
uk_1984_iryna_dybko_khutir_tvaryn: Вже й поза Хутором тварин почали ходити поголоски про голод і страждання в ньому всіх, крім кабанів та свиней.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Стало питанням життя і смерті приховати таке від зовнішнього світу.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Було життєво важливо приховати таке становище на фермі від зовнішнього світу,

source: Once again it was being put about that all the animals were dying of famine and disease, and that they were continually fighting among themselves and had resorted to cannibalism and infanticide.
uk_1984_iryna_dybko_khutir_tvaryn: Навколо говорили люди, як з нестерпного голоду поширивсь і канібалізм. Деякі тварини почали хворіти, а це в парі з голодом, доводило до їхнього кінця.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Ширилися чутки, ніби тварини дохнуть від голоду й хвороб, люто б'ються між собою, ніби є випадки канібалізму й дітоїдства.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Знову поширилися чутки, ніби всі тварини потерпають від голоду та хвороб, що вчиняють побоїща, навіть є випадки канібалізму й пожирання новонароджених.

source: Napoleon was well aware of the bad results that might follow if the real facts of the food situation were known, and he decided to make use of Mr. Whymper to spread a contrary impression.
uk_1984_iryna_dybko_khutir_tvaryn: Тож Вісарйонов вирішив створювати такі познаки при зустрічі з Химерніковим, які заперечували б вісткам людей.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Наполеон добре розумів, які згубні наслідки мали б правдиві факти про становище з продовольством, тому через Вімпера спробував трохи виправити враження.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Наполеон розумів, що такі розмови загрожують репутації ферми, тому вирішив використати містера Вімпера, щоб вибити козирі у зловмисників.

source: Hitherto the animals had had little or no contact with Whymper on his weekly visits: now, however, a few selected animals, mostly sheep, were instructed to remark casually in his hearing that rations had been increased.
uk_1984_iryna_dybko_khutir_tvaryn: Перебування Химернікова на хуторі влаштовував так, щоби недолі й жахіття голоду він не бачив. А стогін недужих тварин заглушували овечки своїм беканням та репетуванням про достаток харчів, бо овечок завжди перед приходом Химернікова як слід годували.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Досі тварини мало або й зовсім не стикалися з Вімпером, коли той щотижня навідувався; одначе тепер кільком довіреним істотам, переважно вівцям, доручили мовби випадково висловлюватися при ньому, що пайку збільшено.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Досі тварини практично не стикалися з містером Вімпером, коли той щотижня навідувався до ферми. Тепер деяким з них, найвідданішім справі колгоспу, головно вівцям, доручили в присутності містера Вімпера недбало обговорювати недавнє збільшення раціону.

source: In addition, Napoleon ordered the almost empty bins in the store-shed to be filled nearly to the brim with sand, which was then covered up with what remained of the grain and meal.
uk_1984_iryna_dybko_khutir_tvaryn: Також наказав Вісарйонов виповнити корита піском, а на вершку притрусити зерном.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: До всього, Наполеон звелів наповнити спорожнілі засіки в хліві по вінця піском, а пісок присипати залишками зерна й корму.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Поза тим, Наполеон велів наповнити порожні засіки піском і прикрити його залишками зерна та іншого корму.

source: On some suitable pretext Whymper was led through the store-shed and allowed to catch a glimpse of the bins.
uk_1984_iryna_dybko_khutir_tvaryn: Тоді заводив туди Химернікова, щоби той бачив повні корита й поширював своє відкриття між людьми, начебто голоду на хуторі немає.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Знайшли привід і провели Вімпера по хліву, аби той побачив засіки.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Тож коли містер Вімпер приїхав наступного разу, знайшовся привід, щоб він побачив засіки.

source: He was deceived, and continued to report to the outside world that there was no food shortage on Animal Farm.
uk_1984_iryna_dybko_khutir_tvaryn: Химерніков повірив у те, що бачив, то й заперечував поголоскам про голод чи недостачу харчів.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Обдурений, він і далі сповіщав зовнішньому світові, що фермі «Рай для Тварин» голод не загрожує.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Обман очей спрацював, і містер Вімпер повідомив світові, що на фермі достатньо їжі.

source: Nevertheless, towards the end of January it became obvious that it would be necessary to procure some more grain from somewhere.
uk_1984_iryna_dybko_khutir_tvaryn: Хоч і вдавалося Вісарйонові обманювати Химернікова дійсність обманові не потурала, вона дивилася очима правди і бачила, як з кожним днем знесилені тварини падали жертвами й не могли будувати вітряку. Це й турбувало його і він не мав іншої ради, як починати шукати за харчами поза Хутором тварин.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Проте на кінець січня стало очевидно — десь треба роздобути хоч трохи зерна.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Проте на кінець січня стало очевидно, що без зерна не вижити.

source: In these days Napoleon rarely appeared in public, but spent all his time in the farmhouse, which was guarded at each door by fierce-looking dogs.
uk_1984_iryna_dybko_khutir_tvaryn: Вісарйонов просиджував, призадумуючись день за днем у головному будинку, а при дверях його три люті пси постійно сторожили.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Наполеон уже рідко з'являвся серед тварин, а сидів безвилазно в будинку, де чатували люті пси.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: У ці дні Наполеон уже майже не виходив до громади, безвилазно сидів у будинку під охороною лютих псів.

source: When he did emerge, it was in a ceremonial manner, with an escort of six dogs who closely surrounded him and growled if anyone came too near.
uk_1984_iryna_dybko_khutir_tvaryn: Виходив він лише з будинку у дні врочистостей, та й то в оточенні шістьох псів, що гарчали як тільки хто наближався до Вісарйонова.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Коли ж він виходив, то чинно і в супроводі шести псів, які починали гарчати, щойно хтось наближався.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Коли ж траплявся такий рідкісний випадок, то підійти до нього теж було неможливо, бо собаки щільно оточували його й одразу гарчали на кожного, хто опинявся занадто близько.

source: Frequently he did not even appear on Sunday mornings, but issued his orders through one of the other pigs, usually Squealer.
uk_1984_iryna_dybko_khutir_tvaryn: Інколи і в неділі не приходив проголосити розпорядження. Його в тому Нікітов виручав, бо і тварини не приходили на мітинги, бо були знеможені голодом і недугою.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Іноді він не з'являвся навіть недільного ранку, передаючи вказівки через свиней, найчастіше через Пищика.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: У неділю він теж показувався зрідка, а замість нього накази зачитували інші свині, найчастіше — Пискун.

source: One Sunday morning Squealer announced that the hens, who had just come in to lay again, must surrender their eggs. Napoleon had accepted, through Whymper, a contract for four hundred eggs a week.
uk_1984_iryna_dybko_khutir_tvaryn: Під кінець січня, в неділю ранком на мітингу Нікітов заявив, що невідкличним рішенням Вісарйонова є, щоби кури зносили кожного тижня по чотириста яєць, бо така кількість потрібна для продажу в Волгограді,
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Якоїсь неділі вранці Пищик оголосив, що в курей, які почали нестися, яйця забиратимуть. Наполеон через Вімпера уклав контракт на продаж чотирьох сотень яєць щотижня.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Одного разу Пискун оголосив, що кури, які саме почали нестися, повинні регулярно здавати яйця, бо Наполеон, за посередництва містера Вімпера, уклав угоду про щотижневий продаж чотирьохсот яєць.

source: The price of these would pay for enough grain and meal to keep the farm going till summer came on and conditions were easier.
uk_1984_iryna_dybko_khutir_tvaryn: за гроші з розпроданих яєць купуватимуть конечну кількість збіжжя та інші харчі, щоб уможливити прожиття до чергових жнив.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: За той виторг, мовляв, куплять збіжжя і провіанту, щоб вистачило протриматися до літа, коли становище покращиться.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: На вторговані гроші буде закуплено зерно і та інші харчі, що дасть змогу фермі протриматися до літа, коли становище покращиться.

source: When the hens heard this, they raised a terrible outcry.
uk_1984_iryna_dybko_khutir_tvaryn: Ця вістка дуже зажурила квочок,
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: На це кури здійняли страшенний ґвалт.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Почувши це, кури зчинили веремію.

source: They were just getting their clutches ready for the spring sitting, and they protested that to take the eggs away now was murder.
uk_1984_iryna_dybko_khutir_tvaryn: бо вони якраз на весну готувались висиджувати курят, а також таку кількість яєць в одному тижні було можливо здійснити, та ще при такому харчуванні як тепер, за постійного голодування. Кури не мали іншої ради як запротестувати проти накинутого їм, жорстокого розпорядження; вперше від часу революції, коли прогнали Романова, стурбовано нарікали вони що відбирати їм таку кількість яєць - це просто душогубство і злочин.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Якраз нанесли яєць для весняного висиджування і тепер протестували, що забрати їх — то самогубство.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Квочки саме готувалися висиджувати курчат і заявили, що забирати яйця тепер — вбивство.

source: For the first time since the expulsion of Jones, there was something resembling a rebellion.
uk_1984_iryna_dybko_khutir_tvaryn: [Кури не мали іншої ради як запротестувати проти накинутого їм, жорстокого розпорядження; вперше від часу революції, коли прогнали Романова,] Такого й за часів Романова не зазнали.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Вперше після вигнання Джонса виник мало не бунт.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Уперше після вигнання Джонса на фермі назрівав бунт.

source: Led by three young Black Minorca pullets, the hens made a determined effort to thwart Napoleon’s wishes.
uk_1984_iryna_dybko_khutir_tvaryn: Під проводом трьох молодих курок, що саме тепер готувалися складати яйця для висиджування курят, усі кури завзялись і спротивились наказові Вісарйонова. При тому посилались на слова Маркова, шо ніяка тварина не має права знущатись над твариною.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: З трьома молодими мінорками на чолі, кури спробували протистояти Наполеонові.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Під керівництвом трьох чорних насідок-цесарок кури перейшли до рішучих дій.

source: Their method was to fly up to the rafters and there lay their eggs, which smashed to pieces on the floor.
uk_1984_iryna_dybko_khutir_tvaryn: Методою курячого бунту було злітати на крокви у стодолі і там зносити яйця, приховуючи їх для висиджування курят.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Вони злітали на сідало і там неслися. Яйця падали на землю і розбивалися.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Вони стали нестися на кроквах під дахом, а яйця падали й розбивалися.

source: Napoleon acted swiftly and ruthlessly.
uk_1984_iryna_dybko_khutir_tvaryn: Ех, і жорстоко розправився Вісарйонов із курми за те:
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Проте Наполеон діяв рішуче й безжалісно.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Проте Наполеон діяв ще безжалісніше:

source: He ordered the hens’ rations to be stopped, and decreed that any animal giving so much as a grain of corn to a hen should be punished by death.
uk_1984_iryna_dybko_khutir_tvaryn: наказав здержати і той мінімальний приділ харчів, що був для них, а хто з тварин посмів би хоч одну зернину дати курці, того стріне кара смерти.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Він заборонив годувати курей і звелів, щоб кожен, хто дасть їм хоч зернятко, буде скараний на горло.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: він заборонив годувати курей, оголосивши, що тварина, яка кине бунтаркам хоч зернину, буде страчена.

source: The dogs saw to it that these orders were carried out.
uk_1984_iryna_dybko_khutir_tvaryn: На сторожі наказу Вісарйонова стояли люті пси, що постійно стерегли курей, щоб вони не вийшли із своїх курників та не шукали їди.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Пси стежили за неухильним виконанням цього наказу.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: А собаки дбатимуть про виконання наказу.

source: For five days the hens held out, then they capitulated and went back to their nesting boxes.
uk_1984_iryna_dybko_khutir_tvaryn: Проходили кошмарні дні голоду, дев’ять чи й десять кістяків курей лежало на подвір’ї й навколо курника, свині не встигали їх закопати, а тим курям, що ще при житті були, радили свині змінити постанову й покоритися наказові Вісарйонова. Та це не помагало, кури вірили, їхні страждання й жертви голоду заговорять до совісті, Вісарйонова й свиней, бо вже й люди, що жили в довкіллі Хутора тварин, довідались, що кури гинуть з-за недостачі харчів, що це так Вісарйонов покарав їх.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: П'ять днів трималися кури, а тоді здалися й повернулися до своїх гнізд.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Кури трималися п’ять днів, а потім здалися й повернулися до своїх наземних гнізд.

source: Nine hens had died in the meantime.
uk_1984_iryna_dybko_khutir_tvaryn: [дев’ять чи й десять кістяків курей лежало на подвір’ї й навколо курника]
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: За цей час здохло дев'ятеро курей.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: За цей час із десяток курей померли.

source: Their bodies were buried in the orchard, and it was given out that they had died of coccidiosis.
uk_1984_iryna_dybko_khutir_tvaryn: Проте Химерніков пояснював, що довідався від Вісарйонова, начебто пошесна недуга є причиною смерти курей.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: їх поховали в садку й оголосили, що вони здохли від коксидіозу.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Їх поховали в садку й повідомили, що причина смерті — гострий кокцидіоз.

source: Whymper heard nothing of this affair, and the eggs were duly delivered, a grocer’s van driving up to the farm once a week to take them away.
uk_1984_iryna_dybko_khutir_tvaryn: Правди на хуторі — чому кури гинуть, ніхто й не довідався. Ті, що ще при житті залишились, почали на команду зносити яйця, і їм за це давали харчові приділи.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Вімпер нічого про цю подію не чув: яйця довозилися вчасно, і фургон бакалійника приїжджав за ними раз на тиждень.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Містер Вімпер навіть не здогадувався про ці події: бакалійник щотижня приїжджав на ферму й забирав вказану в угоді кількість яєць.

source: All this while no more had been seen of Snowball.
uk_1984_iryna_dybko_khutir_tvaryn: Проходили місяці, Давидович пропав, як камінь у воду,
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: А Сніжка більше не бачили.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Увесь цей час ніхто жодного разу не бачив Сніжка.

source: He was rumoured to be hiding on one of the neighbouring farms, either Foxwood or Pinchfield.
uk_1984_iryna_dybko_khutir_tvaryn: але тварини його не забували, переказували одне одному різнорідні новини про Давидовича. Хтось казав, що він переховується в одному з сусідних хуторів,
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Подейкували, нібито він переховується на сусідній фермі — чи то в «Лисячому Гаю», чи то в «Лужку».
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Ходили чутки, що він ховається на одній із сусідніх ферм, — або у «Фоксвуді», або в «Пінчфілді».

source: Napoleon was by this time on slightly better terms with the other farmers than before.
uk_1984_iryna_dybko_khutir_tvaryn: але це не спиняло Вісарйонова нав’язати кращі відносини з Пілсутовим і Федориковим.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Натоді стосунки Наполеона з іншими фермерами дещо покращилися.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Тим часом стосунки Наполеона з фермерами дещо покращилися.

source: It was well seasoned, and Whymper had advised Napoleon to sell it; both Mr. Pilkington and Mr. Frederick were anxious to buy it.
uk_1984_iryna_dybko_khutir_tvaryn: Навіть за порадою Химернікова він задумав продати дерево, оте букове, зрубане ще з-перед десяти років.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Деревина добре підсохла, і Вімпер порадив Наполеону спродати її; купити її раді були як містер Пілкінгтон, так і містер Фредерік.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Він був у доброму стані, тож містер Вімпер порадив Наполеонові продати його, бо знав, що купить і містер Пілкінгтон, і містер Фредерік.

source: Napoleon was hesitating between the two, unable to make up his mind.
uk_1984_iryna_dybko_khutir_tvaryn: Єдине, що здержувало його від дії — це відомість, що не власники хуторів, а Давидович бажав дерево купити.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Наполеон вагався, не знаючи, кому віддати перевагу.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Та Наполеон поки не знав, кому віддати перевагу.

source: Suddenly, early in the spring, an alarming thing was discovered. Snowball was secretly frequenting the farm by night!
uk_1984_iryna_dybko_khutir_tvaryn: Ранньою весною жахлива новина пройняла всіх тварин на хуторі: свині розказували, що коли всі в обіймах ночі спокійно сплять, приходить на хутір Давидович і потайки робить всякого роду злочинства;
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: А напровесні виник новий клопіт. Сніжок потай уночі провідує ферму!
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Ранньою весною було раптово зроблено страшне відкриття: Сніжок таємно відвідує ферму ночами!

source: Every night, it was said, he came creeping in under cover of darkness and performed all kinds of mischief.
uk_1984_iryna_dybko_khutir_tvaryn: [приходить на хутір Давидович і потайки робить всякого роду злочинства;]
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Казали, нібито щоночі, коли западає темрява, він проникав на ферму і чинив усіляку шкоду.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Повідомлялося, що він щоночі проникає на ферму й чинить усілякий безлад.
